# Задача 1
# 1. Создайте функцию merge_list_to_dict
# 2. У функции д.б. 2 параметра
# 3. Функция должна объединять 2 списка, используя zip()
# 4. Конвертируйте объект zip в словарь и вернуть его из функции
# 5. Вызовите функцию, пердав ей 2 списка в качестве аргументов
# 6. Выведите результат вызова в терминал

# Задача 2
# 1.  Перепешите вызов функции merge_list_to_dict так, чтобы использовались аргументы с ключевыми слова
# 2. Добавьте еще один вызов функци,в котором будет один позиционный аргумент, а второй- аргумент с ключевым словом

# Задача 3
# 1. Создайте функцию update_car_info, в которой все именованные аргументы будут объекдиняться в словать Car
# 2. Добавьте в словарь новый ключ is_avaliable со значением True
# 3. Верните из функции измененный словарь
# 4. Вызовите функцию с именованными аргументами brand и price, их значения могут быть любыми
# 5. Выведите в терминал результат

# Задача 4 Распаковка аргументов из списка, словаря
# 1. Создайте список словарей и в нем будет 3 словаря
# 2. Создайте с помощью распаковки 3 переменных, которые будут содержать каждый из 3х словаря
# 3. Создайте функцию, которая будет принимать 2 аргумента и вызове функции делать распаковку словаря
# 4. Вызвать 3 раза, для каждого словаря

# Задача 5.
# 1. Создайте функцию route_info, которой будет передаваться словарь
# 2. Если в словаре есть ключ distance и его значение - целое число, верните строку "Distance to your destination is <distance>"
# 3. Иначе , если в ловаре есть ключи speed и time , верните строку "Distance to your destination is <speed*time>"
# 4. Вызовите функцию несколько раз с разными аргументами
