# Упражнение 1
# Напишите программу, которая сравнивает два списка и выводит список с элементами, которые есть в первом списке, но отсутствуют во втором. Пример работы программы:

list1: [10, 20, 30, 40, 50]
list2: [20, 25, 30, 35, 40]

# Разность списков:  [10, 50]

# Упражнение 2
# Пусть дано множество, которое представляет студентов:


students = {"Tom", "Bob", "Sam"}

# И пусть дано множество, которое представляет рабочих:

employees = {"Tom", "Bob", "Alex", "Mike"}

# Как видно, некоторые одновременно могут учиться и работать.

# Напишите программу, которая находит

# Всех людей в обоих группах

# Всех людей, которые одновременно и учатся, и работают

# Всех людей, которые только учатся, но не работают

# Всех людей, которые либо только учатся, либо только работают, но не одновременно

# Решение
